### Very Good Morning to All

## Numpy
## Pandas
## Matplot Lib
## Seaborn
## Scipy
## Scikit-Learn

## Pandas

## It is the one of package.It is used for Data Manipulation , Vis,Data Cleaning

## Data is stored in Two Ways or data Structure

- Series
- DataFrame

## Series:

#### It is similar one-dim array of Numpy,It is having only one column

In [1]:
import numpy as np

In [2]:
np.array([100,200,300,400])

array([100, 200, 300, 400])

In [3]:
import pandas

In [5]:
pandas.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
import pandas as pd

In [7]:
pd.Series(["one","two","three"])

0      one
1      two
2    three
dtype: object

In [8]:
p = pd.Series(["Ranganayakulu","Ayyappa","Anil","Ravi","Srinu"])
print(p)

0    Ranganayakulu
1          Ayyappa
2             Anil
3             Ravi
4            Srinu
dtype: object

In [9]:
p[0]

'Ranganayakulu'

In [10]:
p[1:4]

1    Ayyappa
2       Anil
3       Ravi
dtype: object

In [11]:
m = pd.Series(["Ranga","Ayyappa","Anil","Ravi","Srinu"],
              index=["Day1","Day2","Day3","Day4","Day5"])
print(m)

Day1      Ranga
Day2    Ayyappa
Day3       Anil
Day4       Ravi
Day5      Srinu
dtype: object

In [12]:
m[0]

'Ranga'

In [13]:
m['Day1']

'Ranga'

In [14]:
m[0][0]

'R'

In [15]:
m.index[1]

'Day2'

In [16]:
m

Day1      Ranga
Day2    Ayyappa
Day3       Anil
Day4       Ravi
Day5      Srinu
dtype: object

In [17]:
m['Day1']

'Ranga'

In [18]:
m['Day1'][0]

'R'

In [20]:
m['Day1'][-1]

'a'

In [21]:
h = pd.Series({"name":"lakshmi","sal":35000,"desig":"Dev"})
h

name     lakshmi
sal        35000
desig        Dev
dtype: object

In [22]:
pd.date_range(start="2-10-2020",end="2-15-2020")

DatetimeIndex(['2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15'],
              dtype='datetime64[ns]', freq='D')

In [23]:
pd.date_range("1-10-2020","10-10-2020",freq="M")

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31', '2020-06-30', '2020-07-31', '2020-08-31',
               '2020-09-30'],
              dtype='datetime64[ns]', freq='M')

In [24]:
pd.date_range("1-10-2020","1-11-2020",freq="30T")

DatetimeIndex(['2020-01-10 00:00:00', '2020-01-10 00:30:00',
               '2020-01-10 01:00:00', '2020-01-10 01:30:00',
               '2020-01-10 02:00:00', '2020-01-10 02:30:00',
               '2020-01-10 03:00:00', '2020-01-10 03:30:00',
               '2020-01-10 04:00:00', '2020-01-10 04:30:00',
               '2020-01-10 05:00:00', '2020-01-10 05:30:00',
               '2020-01-10 06:00:00', '2020-01-10 06:30:00',
               '2020-01-10 07:00:00', '2020-01-10 07:30:00',
               '2020-01-10 08:00:00', '2020-01-10 08:30:00',
               '2020-01-10 09:00:00', '2020-01-10 09:30:00',
               '2020-01-10 10:00:00', '2020-01-10 10:30:00',
               '2020-01-10 11:00:00', '2020-01-10 11:30:00',
               '2020-01-10 12:00:00', '2020-01-10 12:30:00',
               '2020-01-10 13:00:00', '2020-01-10 13:30:00',
               '2020-01-10 14:00:00', '2020-01-10 14:30:00',
               '2020-01-10 15:00:00', '2020-01-10 15:30:00',
               '2020-01-10 16:00:00', '2020-01-10 16:30:00',
               '2020-01-10 17:00:00', '2020-01-10 17:30:00',
               '2020-01-10 18:00:00', '2020-01-10 18:30:00',
               '2020-01-10 19:00:00', '2020-01-10 19:30:00',
               '2020-01-10 20:00:00', '2020-01-10 20:30:00',
               '2020-01-10 21:00:00', '2020-01-10 21:30:00',
               '2020-01-10 22:00:00', '2020-01-10 22:30:00',
               '2020-01-10 23:00:00', '2020-01-10 23:30:00',
               '2020-01-11 00:00:00'],
              dtype='datetime64[ns]', freq='30T')

In [25]:
pd.date_range("1-10-2020","1-15-2020",freq="120T")

DatetimeIndex(['2020-01-10 00:00:00', '2020-01-10 02:00:00',
               '2020-01-10 04:00:00', '2020-01-10 06:00:00',
               '2020-01-10 08:00:00', '2020-01-10 10:00:00',
               '2020-01-10 12:00:00', '2020-01-10 14:00:00',
               '2020-01-10 16:00:00', '2020-01-10 18:00:00',
               '2020-01-10 20:00:00', '2020-01-10 22:00:00',
               '2020-01-11 00:00:00', '2020-01-11 02:00:00',
               '2020-01-11 04:00:00', '2020-01-11 06:00:00',
               '2020-01-11 08:00:00', '2020-01-11 10:00:00',
               '2020-01-11 12:00:00', '2020-01-11 14:00:00',
               '2020-01-11 16:00:00', '2020-01-11 18:00:00',
               '2020-01-11 20:00:00', '2020-01-11 22:00:00',
               '2020-01-12 00:00:00', '2020-01-12 02:00:00',
               '2020-01-12 04:00:00', '2020-01-12 06:00:00',
               '2020-01-12 08:00:00', '2020-01-12 10:00:00',
               '2020-01-12 12:00:00', '2020-01-12 14:00:00',
               '2020-01-12 16:00:00', '2020-01-12 18:00:00',
               '2020-01-12 20:00:00', '2020-01-12 22:00:00',
               '2020-01-13 00:00:00', '2020-01-13 02:00:00',
               '2020-01-13 04:00:00', '2020-01-13 06:00:00',
               '2020-01-13 08:00:00', '2020-01-13 10:00:00',
               '2020-01-13 12:00:00', '2020-01-13 14:00:00',
               '2020-01-13 16:00:00', '2020-01-13 18:00:00',
               '2020-01-13 20:00:00', '2020-01-13 22:00:00',
               '2020-01-14 00:00:00', '2020-01-14 02:00:00',
               '2020-01-14 04:00:00', '2020-01-14 06:00:00',
               '2020-01-14 08:00:00', '2020-01-14 10:00:00',
               '2020-01-14 12:00:00', '2020-01-14 14:00:00',
               '2020-01-14 16:00:00', '2020-01-14 18:00:00',
               '2020-01-14 20:00:00', '2020-01-14 22:00:00',
               '2020-01-15 00:00:00'],
              dtype='datetime64[ns]', freq='120T')

In [38]:
pd.date_range("1-10-2020","1-11-2020",freq="0.1T")

DatetimeIndex(['2020-01-10 00:00:00', '2020-01-10 00:00:06',
               '2020-01-10 00:00:12', '2020-01-10 00:00:18',
               '2020-01-10 00:00:24', '2020-01-10 00:00:30',
               '2020-01-10 00:00:36', '2020-01-10 00:00:42',
               '2020-01-10 00:00:48', '2020-01-10 00:00:54',
               ...
               '2020-01-10 23:59:06', '2020-01-10 23:59:12',
               '2020-01-10 23:59:18', '2020-01-10 23:59:24',
               '2020-01-10 23:59:30', '2020-01-10 23:59:36',
               '2020-01-10 23:59:42', '2020-01-10 23:59:48',
               '2020-01-10 23:59:54', '2020-01-11 00:00:00'],
              dtype='datetime64[ns]', length=14401, freq='6S')

In [39]:
g = pd.Series(pd.date_range("18-5-2020","29-5-2020"))
g

0    2020-05-18
1    2020-05-19
2    2020-05-20
3    2020-05-21
4    2020-05-22
5    2020-05-23
6    2020-05-24
7    2020-05-25
8    2020-05-26
9    2020-05-27
10   2020-05-28
11   2020-05-29
dtype: datetime64[ns]

In [41]:
k = pd.Series(["Ranga","Srinu","Anil","Sastry","Ayyappa"],
              index=[1," ",3," "," "])
k

1      Ranga
       Srinu
3       Anil
      Sastry
     Ayyappa
dtype: object

# DataFrame

In [48]:
g=pd.Series({"names":["vijay","lakshmi","raja"],
              "Sal":[25000,35000,45000],
             "Desig":["Dev","Trainer","texter"]})
g

names    [vijay, lakshmi, raja]
Sal       [25000, 35000, 45000]
Desig    [Dev, Trainer, texter]
dtype: object

In [49]:
g=pd.DataFrame({"names":["vijay","lakshmi","raja"],
              "Sal":[25000,35000,45000],
             "Desig":["Dev","Trainer","texter"]})
g

     names    Sal    Desig
0    vijay  25000      Dev
1  lakshmi  35000  Trainer
2     raja  45000   texter

In [50]:
g.shape

(3, 3)

In [51]:
g.values

array([['vijay', 25000, 'Dev'],
       ['lakshmi', 35000, 'Trainer'],
       ['raja', 45000, 'texter']], dtype=object)

In [52]:
g.keys

<bound method NDFrame.keys of      names    Sal    Desig
0    vijay  25000      Dev
1  lakshmi  35000  Trainer
2     raja  45000   texter>

In [53]:
g.columns

Index(['names', 'Sal', 'Desig'], dtype='object')

In [54]:
g.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
names    3 non-null object
Sal      3 non-null int64
Desig    3 non-null object
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [55]:
g.describe()

           Sal
count      3.0
mean   35000.0
std    10000.0
min    25000.0
25%    30000.0
50%    35000.0
75%    40000.0
max    45000.0

In [56]:
k=g[['names','Desig']]
k

     names    Desig
0    vijay      Dev
1  lakshmi  Trainer
2     raja   texter

In [58]:
k.describe()

       names Desig
count      3     3
unique     3     3
top     raja   Dev
freq       1     1

In [59]:
k

     names    Desig
0    vijay      Dev
1  lakshmi  Trainer
2     raja   texter

In [ ]:
## iloc 
## loc

In [61]:
k.iloc[0]

names    vijay
Desig      Dev
Name: 0, dtype: object

In [65]:
k['names'][0]

'vijay'

In [66]:
k

     names    Desig
0    vijay      Dev
1  lakshmi  Trainer
2     raja   texter

In [67]:
k['names']

0      vijay
1    lakshmi
2       raja
Name: names, dtype: object

In [68]:
k['Desig']

0        Dev
1    Trainer
2     texter
Name: Desig, dtype: object

In [69]:
k['Desig'][1]

'Trainer'

In [71]:
k[['names','Desig']]

     names    Desig
0    vijay      Dev
1  lakshmi  Trainer
2     raja   texter

In [72]:
k.loc[1,'names']

'lakshmi'

In [73]:
k.loc[:,'Desig']

0        Dev
1    Trainer
2     texter
Name: Desig, dtype: object

In [74]:
k.iloc[0][1]

'Dev'

In [75]:
k.loc[0][1]

'Dev'

In [76]:
k.loc[0]

names    vijay
Desig      Dev
Name: 0, dtype: object

In [77]:
#read_csv
k = pd.read_csv("students.csv")
k

   Roll_Num     Name  TMarks  Percentage
0       501      sai     502          92
1       502    vijay     359          65
2       512  sankhar     321          63
3       524     giri     521          94
4       505     hari     565          96
5       504      ran     456          83

In [79]:
k.set_index("Roll_Num")

             Name  TMarks  Percentage
Roll_Num
501           sai     502          92
502         vijay     359          65
512       sankhar     321          63
524          giri     521          94
505          hari     565          96
504           ran     456          83

In [80]:
k

   Roll_Num     Name  TMarks  Percentage
0       501      sai     502          92
1       502    vijay     359          65
2       512  sankhar     321          63
3       524     giri     521          94
4       505     hari     565          96
5       504      ran     456          83

In [81]:
k.set_index('Roll_Num',inplace=True)
k

             Name  TMarks  Percentage
Roll_Num
501           sai     502          92
502         vijay     359          65
512       sankhar     321          63
524          giri     521          94
505          hari     565          96
504           ran     456          83

In [82]:
k.sort_index()

             Name  TMarks  Percentage
Roll_Num
501           sai     502          92
502         vijay     359          65
504           ran     456          83
505          hari     565          96
512       sankhar     321          63
524          giri     521          94

In [83]:
k.sort_values(by="Percentage")

             Name  TMarks  Percentage
Roll_Num
512       sankhar     321          63
502         vijay     359          65
504           ran     456          83
501           sai     502          92
524          giri     521          94
505          hari     565          96

In [84]:
k.sort_values(by="Percentage",ascending=True)

             Name  TMarks  Percentage
Roll_Num
512       sankhar     321          63
502         vijay     359          65
504           ran     456          83
501           sai     502          92
524          giri     521          94
505          hari     565          96

In [85]:
k.sort_values(by="Percentage",ascending=False)

             Name  TMarks  Percentage
Roll_Num
505          hari     565          96
524          giri     521          94
501           sai     502          92
504           ran     456          83
502         vijay     359          65
512       sankhar     321          63

In [86]:
k['Name']

Roll_Num
501        sai
502      vijay
512    sankhar
524       giri
505       hari
504        ran
Name: Name, dtype: object

In [87]:
k[['Name','Percentage']]

             Name  Percentage
Roll_Num
501           sai          92
502         vijay          65
512       sankhar          63
524          giri          94
505          hari          96
504           ran          83

In [88]:
k

             Name  TMarks  Percentage
Roll_Num
501           sai     502          92
502         vijay     359          65
512       sankhar     321          63
524          giri     521          94
505          hari     565          96
504           ran     456          83

In [89]:
k.iloc[2][2]

63

In [91]:
k.loc[512,"Percentage"]

63

In [92]:
k.loc[k['TMarks']>500]

          Name  TMarks  Percentage
Roll_Num
501        sai     502          92
524       giri     521          94
505       hari     565          96

In [93]:
k.loc[505,'TMarks']

565

In [94]:
k.loc[505,'TMarks']=555

In [95]:
k

             Name  TMarks  Percentage
Roll_Num
501           sai     502          92
502         vijay     359          65
512       sankhar     321          63
524          giri     521          94
505          hari     555          96
504           ran     456          83

## Tomorrow is the last session

## Please provide your valuable feedback and feedback videos

### manasa.p@apssdc send mail to this mail  if you didn't receive the mail